// จะมี array สองตัว a={1,0,1,1} + b={0,0,0,1} =>result c={1,1,0,0}
import java.util.*; // อันนี้ในข้อสอบไม่ต้องใช้ อันนี้เอามาเพราะจะใช้คำสั่ง Arrays.toString(); 
public class PushBinaly {
    public static void main(String[] args){
        int[] j = {1,0,1,1};
        int[] k = {0,0,0,1};
        T2_pushbinaly(j,k); // เรียกใช้ Method
    }
    static void T2_pushbinaly(int[] a,int[] b){
        int[] c=new int[4];
        c[0] = 0;
        c[1] = 0;
        c[2] = 0;
        c[3] = 0;
        // โปรแกรมนี้จะคิดจากข้างหลังไปข้างหน้านะ เวลาทดเลขจะได้ง่ายๆ
        for(int i=a.length-1;i>=0;i--){
            // แบ่งเป็น 3 เหตุการณ์คือเจอ 0+1,1+1,0+0
            if(a[i]==1&&b[i]==0 || a[i]==0&&b[i]==1){ //0+1
                if(c[i]==0){ // เช็คว่ามีเลขทดอยู่แล้วมั้ย
                    c[i] = 1; // ไม่มีใส่ 1 ได้เลย(ถ้ามีจะเป้นเลข 1)
                }
                else{
                    c[i] = 0; // ถ้ามีเปลี่ยนเป็น 0 
                    c[i-1] = 1; // แล้วไปทดไว้ช่องถัดไปไว้เลย
                }
            }else if(a[i]==1&&b[i]==1){ //1+1
                c[i-1] = 1; // ทดใส่ช่องทัดไปได้เลย
            }
            else{ // 0+0 
                // ไม่ต้องทำไรเพราะมันจะมีค่าเท่าเดิมคือ0หรือ1
            }
        }
        System.out.println(Arrays.toString(c));// สำหรับแสดง binaly ที่คิดแล้ว
    }
}
